<template>
  <v-app>
    <v-timeline style="padding: 20px">
      <v-timeline-item
        v-for="(year, i) in years"
        :key="i"
        :color="year.color"
        small
      >
        <template v-slot:opposite>
        <span
          :class="`headline font-weight-bold ${year.color}--text`"
          v-text="year.year"
        ></span>
        </template>
        <div class="py-4">
          <h2 :class="`headline font-weight-light mb-4 ${year.color}--text`">
            {{year.title}}
          </h2>
          <div>
            {{year.text}}
          </div>
        </div>
      </v-timeline-item>
    </v-timeline>
  </v-app>
</template>

<script>
    export default {
        name: "AboutChurch",
        data: () => ({
          years: [
            {
              color: 'cyan',
              year: '27 р. н. е.',
              title: 'виникло Християнство',
              text: 'Християнство виникло у I столітті в Юдеї, на той час провінції Римської Імперії, його засновником став Ісус з Назарета, який вважається християнами Сином Божим. Поява Ісуса Христа передбачалася багатьма пророками, про що зазначено у Старому Заповіті, а безпосередньо початку проповідування Ісуса передувала діяльність Івана Хрестителя, який, очікуючи Христа, проповідував і хрестив людей на річці Йордан з жовтня 27 р. н. е.'

            },
            {
              color: 'green',
              year: '27-33 р. н. е.',
              title: 'встановленням Христом Церкви',
              text: 'Богослови[3] виділяють кілька етапів встановленням Христом Церкви. Ісус покликав до себе учнів[4], вибрав з-поміж них апостолів[5] та послав їх проповідувати «Царство Боже»[6]. Важливим етапом було встановлення таїнств, зокрема хрещення,[7] Причастя[8], Покути[9] і священства[10]. Перед смертю Ісус Христос заповів своєму учневі Петру, що на ньому Він збудує «Церкву Свою»[11] і заповів Петрові «ключі» «від Царства Небесного»[12]'
            },
            {
              color: 'pink',
              year: '27-33 р. н. е.',
              title: 'Кульмінаційний момент християнства',
              text: 'Кульмінаційним моментом християнства вважається мученицька смерть і воскресіння Христове. Християни вважають, що саме завдяки жертвенній смерті Ісуса Христа кожна людина отримала можливість спасіння, а згідно зі словами самого Ісуса «ніхто не приходить до Отця, як тільки через мене»[13]. Воскресіння Христа нерозривно пов\'язується з майбутнім воскресінням мертвих[14], «бо як не воскреснуть мертві, то і Христос не воскрес. А як Христос не воскрес, то марна віра ваша, — ви ще у гріхах ваших»[15]'
            },
            {
              color: 'amber',
              year: '27-33 р. н. е.',
              title: 'сходження Святого Духа',
              text: 'Вознесіння та сходження Святого Духа є завершальним етапом творення Церкви, вважається, що з цього моменту Христос постійно діє у Церкві через Святого Духа[3]. Першими священиками стали апостоли, яким Ісус перед вознесінням заповідав зробити учнями «всі народи, христячи їх в ім\'я Отця і Сина і Святого Духа»,[7] обіцяючи бути з ними «по всі дні аж до кінця віку»[16]. В свою чергу, апостоли надавали священицьку владу іншим, настановляли їх єпископами[3], заповідаючи їм наступне:\n' +
                '\n' +
                '«Пильнуйте себе та всієї отари, в якій Святий Дух вас поставив єпископами, щоб пасти Церкву Божу, яку власною кров\'ю набув Він»[17]\n'
            },
            {
              color: 'green',
              year: '1000',
              title: 'Христос заповідав християнам єдність',
              text: 'Христос заповідав християнам єдність, про що, зокрема свідчать такі слова:\n' +
                '\n' +
                '«Та не тільки за них Я благаю, а й за тих, що ради їхнього слова ввірують у Мене, щоб були всі одно: як Ти, Отче, в Мені, а Я у Тобі, щоб одно були в Нас і вони, щоб увірував світ, що Мене Ти послав.»[18]\n' +
                '. Богослови також наголошують на тому, що слово Церква в Біблії вживається в однині[19], зокрема й Ісусом у заповіті апостолові Петрові.[11] Апостол Павло застерігав християн, «щоб ви всі говорили те саме, і щоб не було поміж вами поділення, але щоб були ви поєднані в однім розумінні та в думці одній!»[20].'
            },
            {
              color: 'blue',
              year: '1054',
              title: 'Проте історія християнської церкви засвідчила декілька розколів',
              text: 'Найбільшим в історії християнської церкви став Розкол 1054 року, що розділив християнство на дві великі конфесії — католицизм і православ\'я. В період реформації від католицизму відокремився протестантизм, який в свою чергу також поділився на кілька течій. Внутрішні церковні розколи відбувалися і всередині найбільших конфесій, наприклад Папська схизма в кінці XIV століття, або поява «неканонічних» православних церков.'
            },
            {
              color: 'blue',
              year: '....',
              title: 'Межі церкви в Біблії',
              text: 'Образ тіла, вказуючи на органічну єдність вірних зі своїм главою Христом і між собою (Рим. 12, 5), разом з тим передбачає існування межі (границі), яка відділяє їх від решти людства. Неможливо брати участь у житті тіла, не будучи його членом. Тих, хто належить до Церкви, ап. Павло називає «внутрішніми», протиставляючи їм синів світу цього як «зовнішніх» (1 Кор. 5, 12-13). Разом з тим можливі випадки, коли при збереженні видимої приналежності до Церкви фактично людина опиняється поза Нею (пор.: 1 Кор. 5, 1-11). Тобто сам факт вступу до Церкви через хрещення ще не гарантує незмінної участі у властивому Їй благодатному житті. Дар Христовий повинен бути не тільки збережений, але й примножений (пор.: Мф. 25, 14-27). Він вимагає динамічного сприйняття і невпинного розвитку, «зігрівання» (2  Тим.  1, 6) перш за все через дотримання заповідей (Ін. 15, 10) і достойне євхаристійне причастя (Ін. 6, 56). Навпаки, відступаючи від євангельської правди, людина знову стає заручником світу цього, робиться «рабом тління» (2 Петр. 2, 19-21) і тим самим вивергається з Тіла Церкви (Ін. 15, 6). Відпадіння від Церкви не завжди пов\'язане з відлученням як видимим церковним актом (1 Кор. 5, 2, 5, 13), відпадіння від Тіла Христового може бути й невидимими (пор.: Об. 3, 1). Однак розрив з Церквою не є незворотнім. Через покаяння дар Христового життя може бути відновлений (пор.: Об. 3, 3), це дозволяє припустити, що якийсь таємничий зв\'язок між Церквою і відпалим від неї грішником усе ж зберігається.'
            },
            {
              color: 'red',
              year: '....',
              title: 'Християнські церкви сьогодні',
              text: 'Загалом близько 2 106 962 000 людей із 238 країн світу або 33 % земного населення вважають себе християнами. На сьогоднішній день в християнській церкві, як спільноті виділяють 3 основних течії: Католицизм, Протестантизм, Православ\'я, та низку дрібніших.\n' +
                '\n' +
                'Католицизм представлений Римо-католицькою церквою та рядом Східних Католицьких Церков. На чолі Католицької Церкви стоїть Римський єпископ — Римський Папа.\n' +
                '\n' +
                'Православ\'я представлено 15 автокефальними церквами, що мають між собою євхаристійне спілкування, а також рядом церков, які не визнаються цими 15 церквами.\n' +
                '\n' +
                'Як єдиної в адміністративно-організаційному плані Протестантської Церкви не існує. Ця течія представлена сотнями течій, з чисельністю від сотні членів до багатомільйонних спільнот. В цьому напрямі існують безліч відгалужень зокрема: Адвентисти, Англікани, Баптисти, Кальвіністи, Лютерани, П\'ятидесятники, Харизмати та безліч інших.\n' +
                '\n' +
                'Суть християнського віровчення є викладена в 12 постулатах Символу Віри, який виголошується тими хто вступають в християнську церкву через обряд Хрещення, що вважається духовним перенародженням та омиттям від гріхів через Христову Кров. В православній і католицькій церквах Символ Віри виголошується вірними християнами під час кожного богослужіння з Причастя.'
            },
            {
              color: 'blue',
              year: '....',
              title: 'Виникла "Блага вість" в місті Черкаси',
              text: 'Узнайте о том, во что мы верим, наш взгляд на Писание, понимание Бога, человека и многое другое. Эти утверждения, основанные на Библии, определяют наши действия, как церкви.\n' +
                '\n' +
                'Библия.\n' +
                'Библия – это Божье руководство для всех людей. Она была написана посредством разных людей под сверхъестественным руководством Святого Духа. И так, как это боговдохновенная книга, она является истинной и безусловно практичной.\n' +
                '\n' +
                'Второзаконие 4:1-2; Псалом 118:11, 89, 105; Исаия 40:8, Матфея 22:29; Иоанна 5:39, 17:17; 1 Петра 1:25; Римлянам 15:4; 2 Тимофею 3:15-17; Евреям 4:12.\n' +
                '\n' +
                'Троица.\n' +
                'Бог существует в вечности. Он един, но в трех Лицах – Бог Отец, Бог Сын и Бог Дух Святой. Каждый из них имеет равную власть, обладают одной природой, но имеют особую собственную личность.\n' +
                '\n' +
                'Второзаконие 6:4; Исаия 61:1; Матфея 28:19; Марка 1:9-11; Луки 1:35; Иоанна 5:21-23; 14: 10, 16; Иакова 2:19; Римлянам 8:9-11; 1 Коринфянам 8:6; 2 Коринфянам 13:13; Евреям 1:8-10.\n' +
                '\n' +
                'Бог Отец.\n' +
                'Бог всемогущ, всезнающ, вездесущ, неизменен, свят и справедлив. В Не мы живет, движемся и существуем. Он наш добрый и любящий Отец, сострадательный и верный Своим обещаниям и Своему народу.\n' +
                '\n' +
                'Исход 3:14; Числа 23:19; Левит 11: 44-45; 19:2; Псалом 11:4-6; Малахия 3:6; Иоанна 3:16; 4:24; 5:26; 14:1; Деяния 17:28; Римлянам 3: 3-4.\n' +
                '\n' +
                'Бог Сын.\n' +
                'Иисус Христос во время Своего пребывания на земле обладал в совершенстве человеческой природой, но в то же время Он оставался Богом. Иисус — это единственный путь обращения людей, далеких от Бога, к правильным отношениям с Богом. Он прожил совершенную жизнью, чтобы стать заместительной жертвой вместо нас для удовлетворения Божьего требования святости. Он победил смерть в Своим воскресением, чтобы мы могли обрести жизнь вечную.\n' +
                '\n' +
                'Исаия 7:14; Матфея 1:18-23; 3:17; 8:29; 14:33; 16:16; 28:5-6; Луки 22:70; 24:46-47; Иоанна 1: 1, 14; 10:30; 11:25-27; 17:1-5; Деяния 1:9; 2:22-24; 7:55-56; Римлянам 1:3-4; 3:23-26; 8:1-3; 10:4; 1 Коринфянам 8:6; 2 Коринфянам 5:19-21; Галатам 4:4-5; Филиппийцам 2:5-11; Колоссянам 1:15; 2:9; 1 Тимофею 2:5-6; 3:16.\n' +
                '\n' +
                'Бог Дух Святой.\n' +
                'Присутствие Святого Духа свидетельствует нам о наших отношениях со Христом. Он направляет верующих к истине во всей ее полноте и прославляет Христа. Он обличает людей в их грехе, свидетельствует о Божьей праведности и грядущем суде. Он утешает нас, дает нам духовные дары и делает нас более похожими на Христа.\n' +
                '\n' +
                'Бытие 1:2; Исаия 61:1-3; Иоиль 2:28-32; Марка 1:10; Луки 1:35; 4:1; 11:13; 12:12; Иоанна 15:26; 16:7-14; Деяния 1:8; 2:1-4; 13:2; Римлянам 8:9-11, 14-16, 26-27; 1 Коринфянам 3:16; Ефесянам 1:13-14; 2 Петра 1:21; Откровение 22:17.\n' +
                '\n' +
                'Вечность.\n' +
                'Человек создан, чтобы существовать вечно. И он будет либо существовать вечно отделенным грехом от Бога, либо в союзе с Богом через прощение и спасение. Вечное отделение от Бога — это ад. Вечный союз с Ним — это Небеса. Рай и ад — места вечного существования.\n' +
                '\n' +
                'Иоанна 3:16, 36; Римлянам 6:23; 1 Иоанна 2:25; 5:11-13; Откровение 20:15.\n' +
                '\n' +
                'Человек.\n' +
                'Человек создан по образу Бога и является венцом Его творения. Он был создан для общения с Богом, но из-за греховного непослушания утратил эту привилегию. В результате чего человек неспособен достичь правильных отношений с Богом только своими собственными усилиями. Каждый человек уникален, достоин уважения и христианской любви.\n' +
                '\n' +
                'Бытие 1:26-30; 2: 7, 18-22; 3; Псалмы 8:3-6; 32: 1-5; 51: 5; Исаия 6:5; Иеремия 17:5; Деяния 17: 26-31; Римлянам 1:19-32; 3: 10-18, 23; 5:6; 6:6; 7:14-25; 1 Коринфянам 1:21-31; 15:19, 21-22; Ефесянам 2; Колоссянам 1:21-22; 3: 9-11.\n' +
                '\n' +
                'Спасение.\n' +
                'Кровь Иисуса Христа, пролитая на кресте, обеспечивает единственный путь спасения через прощение греха. Спасение происходит в тот момент, когда человек верой принимает что смерть и воскресение Христа — это достаточная плата за его грех. Спасение — это дар от Бога, и его нельзя заработать своими силами.\n' +
                '\n' +
                'Исаия 1:18; 53:5-6; 55:7; Матфея 1:21; 27:22-66, 28:1-6; Луки 1:68-69; 2:28-32; Иоанна 1:12; 3:16, 36; 5:24; Деяния 2:21; 4:12; 16: 30-31; Римлянам 1:16-18; 3:23-25; 5:8-10; 6; 1 Коринфянам 1:18; 2 Коринфянам 5:17-20; Галатам 2:20; 3:13; Ефесянам 2:8-10; Филиппийцам 2:12-13; Евреям 9:24-28; Откровение 3:20.\n' +
                '\n' +
                'Церковь.\n' +
                'Церковь — это местная община крещеных верующих, объединенных верой во Христа. Церковь верна учению Христа и соблюдает все Его заповеди, и стремится нести Евангелие миру. Церковь – это Божья семья, которая трудится вместе в любви и единстве, стремясь достичь конечной цели прославления Христа.\n' +
                '\n' +
                'Матфея 16:18-19; 18:15-20; Деяния 2:41-47; 5:11-14; 13: 1-3; 14:23; 16:5; 20:28; 1 Коринфянам 7:17; 9: 13-14; 12; Ефесянам 1:22-23; 2, 19-22; 3:10-12; 5:22-32; Колоссянам 1:18; 3:15; 1 Тимофею 4:14; 1 Петра 5:1-4; Откровение 21:2-3.'
            },
          ],
      }),
    }
</script>

<style scoped>

</style>
